In [1]:
import numpy as np
import pandas as pd

In [2]:
ds = np.array(['03-04-2005 11:35 PM','23-05-2010 12:01 AM','04-09-2009 09:09 PM'])

In [3]:
[pd.to_datetime(date, format='%d-%m-%Y %I:%M %p') for date in ds]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [4]:
[pd.to_datetime(date, format='%d-%m-%Y %I:%M %p',errors="coerce") for date in ds ]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [5]:
pd.Timestamp('2017-05-01 06:00:00', tz='Europe/London')

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [6]:
date = pd.Timestamp('2017-05-01 06:00:00')

In [7]:
dil = date.tz_localize('Europe/London')

In [8]:
dil

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [9]:
dil.tz_convert('Africa/Abidjan')

Timestamp('2017-05-01 05:00:00+0000', tz='Africa/Abidjan')

In [10]:
dates = pd.Series(pd.date_range('2/2/2002', periods=3, freq='M'))

In [11]:
dates.dt.tz_localize('Africa/Abidjan')

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

In [12]:
dates.dt.tz_localize('Africa/Abidjan')

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

In [13]:
from pytz import all_timezones

In [14]:
all_timezones[0:2]

['Africa/Abidjan', 'Africa/Accra']

In [15]:
df = pd.DataFrame()

In [16]:
df['date'] = pd.date_range('1/1/2001', periods=100000, freq='H')

In [17]:
df[(df['date'] > '2002-1-1 01:00:00') & (df['date'] <= '2002-1-1 04:00:00')]

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

In [18]:
df = df.set_index(df['date'])

In [19]:
df.loc['2002-1-1 01:00:00':'2002-1-1 04:00:00']

                                   date
date
2002-01-01 01:00:00 2002-01-01 01:00:00
2002-01-01 02:00:00 2002-01-01 02:00:00
2002-01-01 03:00:00 2002-01-01 03:00:00
2002-01-01 04:00:00 2002-01-01 04:00:00

In [20]:
df = pd.DataFrame()

In [21]:
df['date'] = pd.date_range('1/1/2001', periods=150, freq='W')

In [24]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['hour'] = df['date'].dt.hour
df['minute'] = df['date'].dt.minute

In [25]:
df.head(3)

        date  year  month  day  hour  minute
0 2001-01-07  2001      1    7     0       0
1 2001-01-14  2001      1   14     0       0
2 2001-01-21  2001      1   21     0       0

In [27]:
df = pd.DataFrame()
df['Arrived'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-04-2017')]
df['Left'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-06-2017')]

In [29]:
pd.Series(delta.days for delta in (df['Left'] - df['Arrived']))

0    0
1    2
dtype: int64

In [30]:
dates = pd.Series(pd.date_range("2/2/2002", periods=3, freq="M"))

In [31]:
dates.dt.weekday_name

0    Thursday
1      Sunday
2     Tuesday
dtype: object

In [32]:
dates.dt.weekday

0    3
1    6
2    1
dtype: int64

In [33]:
df = pd.DataFrame()

In [36]:
df['dates'] = pd.date_range("1/1/2001", periods=5, freq="D")
df['stock_price'] = [1.1,2.2,3.3,4.4,5.5]

In [37]:
df["previous_days_stock_price"] = df["stock_price"].shift(1)

In [38]:
df

       dates  stocl_price  stock_price  previous_days_stock_price
0 2001-01-01          1.1          1.1                        NaN
1 2001-01-02          2.2          2.2                        1.1
2 2001-01-03          3.3          3.3                        2.2
3 2001-01-04          4.4          4.4                        3.3
4 2001-01-05          5.5          5.5                        4.4

In [39]:
time_index = pd.date_range("01/01/2010",periods=5, freq="M")

In [40]:
df = pd.DataFrame(index=time_index)

In [41]:
df["Stock_Price"] = [1,2,3,4,5]

In [42]:
df.rolling(window=2).mean()

            Stock_Price
2010-01-31          NaN
2010-02-28          1.5
2010-03-31          2.5
2010-04-30          3.5
2010-05-31          4.5

In [43]:
time_index = pd.date_range("01/01/2010",periods=5, freq="M")

In [44]:
df = pd.DataFrame(index=time_index)

In [45]:
df['Sales'] = [1.0, 2.0, np.nan, np.nan, 5.0]

In [46]:
df.interpolate()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

In [47]:
df.ffill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

In [48]:
df.bfill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

In [49]:
df.interpolate(method="quadratic")

               Sales
2010-01-31  1.000000
2010-02-28  2.000000
2010-03-31  3.059808
2010-04-30  4.038069
2010-05-31  5.000000

In [50]:
df.interpolate(limit=1, limit_direction="forward")

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0